/*
=============================================================================
        Copyright (C) 1997-1999 NINTENDO Co.,Ltd.
        
        $RCSfile: ctype.h,v $
        $Revision: 1.1.1.1 $
        $Date: 2002/10/30 02:07:09 $
=============================================================================
関数名：iscntrl
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int iscntrl(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c がコントロール文字か調べる（マクロ）
=============================================================================
関数名：isdigit
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int isdigit(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c が'0'～'9'であるか調べる（マクロ）
=============================================================================
関数名：islower
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int islower(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c がアルファベットの小文字'a'～'z'であるか調べる（マクロ）
=============================================================================
関数名：isupper
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int isupper(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c がアルファベットの大文字'A'～'Z'であるか調べる（マクロ）
=============================================================================
関数名：isxdigit
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int isxdigit(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c が１６進数をあらわす文字'A'～'F'、'a'～'f'、'0'～'9'で
        あるか調べる（マクロ）
=============================================================================
関数名：isalnum
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int isalnum(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c が英数字'A'～'Z'、'a'～'z'、'0'～'9'であるか調べる（マクロ）
=============================================================================
関数名：isascii
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int isascii(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c が0x00～0x7fであるか調べる（マクロ）
-----------------------------------------------------------------------------
=============================================================================
関数名：isspace
-----------------------------------------------------------------------------
書式：  #include <ctype.h>
        int isspace(int c);
引数：  c 文字コード
戻り値：条件を満たす場合ば０以外を返す
説明：  引数 c が0x09～0x0d,0x20であるか調べる（マクロ）
-----------------------------------------------------------------------------
*/
#ifndef __CTYPE_H__
#define __CTYPE_H__

#ifdef _LANGUAGE_C_PLUS_PLUS
extern "C" {
#endif

extern  unsigned char __MojiStat[0x101];

#define _ISCNTRL     0x01    /*  0x00～0x1f, 0x7f    */
#define _ISDIGIT     0x02    /*  '0'～'9'    */
#define _ISLOWER     0x04    /*  'a'～'z'    */
#define _ISUPPER     0x08    /*  'A'～'Z'    */
#define _ISXDIGIT    0x10    /*  'A'～'F', 'a'～'f', '0'～'9'    */
#define _ISSPACE     0x20    /*  0x09-0x0d , 0x20 */


#define iscntrl(c)  ((__MojiStat+1)[c] & _ISCNTRL)
#define isdigit(c)  ((__MojiStat+1)[c] & _ISDIGIT)
#define islower(c)  ((__MojiStat+1)[c] & _ISLOWER)
#define isupper(c)  ((__MojiStat+1)[c] & _ISUPPER)
#define isxdigit(c) ((__MojiStat+1)[c] & _ISXDIGIT)
#define isalnum(c)  ((__MojiStat+1)[c] & (_ISDIGIT | _ISLOWER | _ISUPPER))
#define isascii(c)  ((__MojiStat+1)[c] & (_ISLOWER | _ISUPPER))
#define isspace(c)  ((__MojiStat+1)[c] & _ISSPACE)

#ifdef _LANGUAGE_C_PLUS_PLUS
}
#endif
#endif
